files/collections/PMAK-68ba2ba23093ae0001f335c5-6ac1ba92c75a29f896e9dfcec3ef2ebefe/11-01-2025/5845306-BI Download.json

{"collection":{"info":{"_postman_id":"1df90e73-f92b-407c-a71a-69b9616ea345","name":"BI Download","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json","updatedAt":"2025-04-21T20:20:48.000Z","createdAt":"2023-09-05T20:14:26.000Z","lastUpdatedBy":"5845306","uid":"5845306-1df90e73-f92b-407c-a71a-69b9616ea345"},"item":[{"name":"BI Download Example Customers","event":[{"listen":"test","script":{"id":"9c13ffb9-7375-4b2e-991a-a8c942ebdcac","exec":["var xmlTree = xml2Json(responseBody);\r","var response = (xmlTree[\"env:Envelope\"][\"env:Body\"][\"ns2:runReportResponse\"][\"ns2:runReportReturn\"][\"ns2:reportBytes\"]);\r","console.clear();\r","//console.log(response);\r","//console.log(atob(response));\r","console.log(Buffer.from(response, 'base64').toString('ascii'));\r","\r",""],"type":"text/javascript","packages":{}}}],"id":"5fd2672c-21d8-4297-9c11-282ee1328019","protocolProfileBehavior":{"disableBodyPruning":true,"disabledSystemHeaders":{"content-type":true}},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n    <soapenv:Body>\r\n        <pub:runReport>\r\n            <pub:reportRequest>\r\n                <pub:reportAbsolutePath>/Custom/LilyLTest/BIDownloadTest_Report.xdo</pub:reportAbsolutePath>\r\n                <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n                <pub:attributeLocale>en-US</pub:attributeLocale>\r\n                <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n                <pub:attributeFormat>xml</pub:attributeFormat>\r\n                <pub:byPassCache>true</pub:byPassCache>\r\n                <pub:flattenXML>false</pub:flattenXML>\r\n                <pub:parameterNameValues>\r\n                    <pub:item>\r\n                        <pub:name>CUSTLEVELFILTER</pub:name>\r\n                        <pub:values>\r\n                            <pub:item>1</pub:item>\r\n                        </pub:values>\r\n                    </pub:item>\r\n                    <pub:item>\r\n                        <pub:name>PROFILELEVELFILTER</pub:name>\r\n                        <pub:values>\r\n                            <pub:item>1</pub:item>\r\n                        </pub:values>\r\n                    </pub:item>\r\n                    <pub:item>\r\n                        <pub:name>PARTYNAME</pub:name>\r\n                        <pub:values>\r\n                            <pub:item>Apex Solut%s</pub:item>\r\n                        </pub:values>\r\n                    </pub:item>\r\n                    <pub:item>\r\n                        <pub:name>SUSTARTDATE</pub:name>\r\n                        <pub:values>\r\n                            <pub:item>2010-11-22</pub:item>\r\n                        </pub:values>\r\n                    </pub:item>\r\n                </pub:parameterNameValues>\r\n            </pub:reportRequest>\r\n        </pub:runReport>\r\n    </soapenv:Body>\r\n</soapenv:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]}},"response":[],"uid":"5845306-5fd2672c-21d8-4297-9c11-282ee1328019"},{"name":"BI Download Example Invoices","event":[{"listen":"test","script":{"id":"9c13ffb9-7375-4b2e-991a-a8c942ebdcac","exec":["var xmlTree = xml2Json(responseBody);\r","var response = (xmlTree[\"env:Envelope\"][\"env:Body\"][\"ns2:runReportResponse\"][\"ns2:runReportReturn\"][\"ns2:reportBytes\"]);\r","console.clear();\r","console.log(response);\r","console.log(atob(response));\r","console.log(xml2Json(atob(response)));"],"type":"text/javascript","packages":{}}}],"id":"9d0d6953-f553-4581-8cf1-2403da870cb0","protocolProfileBehavior":{"disableBodyPruning":true,"disabledSystemHeaders":{"content-type":true}},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:runReport>\r\n      <pub:reportRequest>\r\n        <pub:reportAbsolutePath>/Custom/More4apps-Example/Example/INVOICE_PRIMARY_DOWNLOAD_REPORT.xdo</pub:reportAbsolutePath>\r\n        <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n        <pub:attributeLocale>en-US</pub:attributeLocale>\r\n        <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n        <pub:attributeFormat>xml</pub:attributeFormat>\r\n        <pub:byPassCache>true</pub:byPassCache>\r\n        <pub:flattenXML>false</pub:flattenXML>\r\n        <pub:parameterNameValues>\r\n          <pub:item>\r\n            <pub:name>INVOICE_NUMBER_PARAM</pub:name>\r\n            <pub:values>\r\n              <pub:item>LilyTestDFF1</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n          <pub:item>\r\n            <pub:name>EXCLUDE_LINE_SECTION_PARAM</pub:name>\r\n            <pub:values>\r\n              <pub:item>N</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n          <pub:item>\r\n            <pub:name>SIBLING_LINE_SECTION_PARAM</pub:name>\r\n            <pub:values>\r\n              <pub:item>N</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n          <pub:item>\r\n            <pub:name>EXCLUDE_DISTRIBUTION_SECTION_PARAM</pub:name>\r\n            <pub:values>\r\n              <pub:item>N</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n          <pub:item>\r\n            <pub:name>EXCLUDE_INSTALLMENT_SECTION_PARAM</pub:name>\r\n            <pub:values>\r\n              <pub:item>N</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n          <pub:item>\r\n            <pub:name>SIBLING_INSTALLMENT_SECTION_PARAM</pub:name>\r\n            <pub:values>\r\n              <pub:item>N</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n        </pub:parameterNameValues>\r\n      </pub:reportRequest>\r\n    </pub:runReport>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]}},"response":[],"uid":"5845306-9d0d6953-f553-4581-8cf1-2403da870cb0"}],"auth":{"type":"basic","basic":[{"key":"password","value":"{{Password}}","type":"string"},{"key":"username","value":"{{Username}}","type":"string"}]},"event":[{"listen":"prerequest","script":{"id":"05366679-db97-450d-9f98-26347a5c29a5","type":"text/javascript","packages":{},"exec":[""]}},{"listen":"test","script":{"id":"c5dedcd6-ccca-4173-97e4-cd391ba5e00e","type":"text/javascript","packages":{},"exec":[""]}}]}}